---
kind: method
id: M:Autodesk.Revit.DB.View.GetSketchyLines
zh: 视图
source: html/62ec5bed-dfb7-0782-924b-71e12a82756d.htm
---
# Autodesk.Revit.DB.View.GetSketchyLines Method

**中文**: 视图

Returns the current sketchy lines settings for the view.

## Syntax (C#)
```csharp
public ViewDisplaySketchyLines GetSketchyLines()
```

## Returns
Current sketchy lines settings.